app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 3]]
---
  <tbody>
    <% current_user.tasks.each do |task| %>