app/controllers/tasks_controller.rb

def iCal

    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 14]]

def sms


    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 14]]

  def index



    @tasks = Task.order('user_id ASC').reorder('date ASC')
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 3]]

  def create
    @task = Task.new(task_params)

    @task.user = current_user

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "date", "time", "category", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Finish my app"], ["date", ""], ["time", ""], ["category", ""], ["user_id", 2], ["created_at", "2016-06-03 17:13:07.610152"], ["updated_at", "2016-06-03 17:13:07.610152"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "title" = $1, "date" = $2, "time" = $3, "category" = $4, "updated_at" = $5 WHERE "tasks"."id" = $6  [["title", "A"], ["date", "2016-05-20"], ["time", "A"], ["category", "A"], ["updated_at", "2016-06-04 08:53:44.628104"], ["id", 3]]