app/controllers/users_controller.rb

UPDATE "users" SET "mobile" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["mobile", "1234"], ["updated_at", "2016-06-03 16:25:37.549350"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)